blogdemo2/backend/views/post/index.php

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---
        	[
        		'attribute'=>'status',
        		'value'=>'status0.name',
        		'filter'=>Poststatus::find()
        			->select(['name', 'id'])
        			->orderBy('position')
        			->indexBy('id')
        			->column(),