blogdemo2/common/models/Adminuser.php

SELECT * FROM `adminuser` WHERE `id`=5
---
    public static function findIdentity($id)
    {
    	return static::findOne(['id' => $id]);