blogdemo2/backend/views/adminuser/privilege.php

SELECT * FROM `adminuser` WHERE `id`='1'
---
use yii\widgets\ActiveForm;
use common\models\Adminuser;

$model = Adminuser::findOne($id);