blogdemo2/backend/controllers/AdminuserController.php

	public function actionPrivilege($id)
	{
		//1、所有组
		$allPrivileges = AuthItem::find()->select(['name', 'description'])
		->where(['type'=>1])->orderBy('description')->all();//角色
		foreach ($allPrivileges as $pri)
		{
			$allPrivilegesArray[$pri->name] = $pri->description;//['admin'=>'系统管理员']
		}

		//2、当前用户所在的组
		$AuthAssignments = AuthAssignment::find()->select(['item_name'])
		->where(['user_id'=>$id])->all();
		$AuthAssignmentsArray = array();
		foreach ($AuthAssignments as $AuthAssignment)
		{
			array_push($AuthAssignmentsArray, $AuthAssignment->item_name);
		}

		//3、根据表单提交的数据，更新auth_assigment表
		if (isset($_POST['newPri']))
		{
			AuthAssignment::deleteAll('user_id=:id',[':id'=>$id]);
---
SELECT `name`, `description` FROM `auth_item` WHERE `type`=1 ORDER BY `description`
SELECT `item_name` FROM `auth_assignment` WHERE `user_id`='1'
DELETE FROM `auth_assignment` WHERE user_id='1'