blogdemo2/backend/views/comment/index.php

        	[
        		'attribute' => 'status',
        		'value' => 'status0.name',
        		'filter' => Commentstatus::find()
        		->select(['name', 'id'])
        		->orderBy('position')
        		->indexBy('id')
        		->column(),
---
SELECT `name`, `id` FROM `commentstatus` ORDER BY `position`